In [2]:
import numpy as np
import pandas as pd
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

# 1. Cách tạo ra data frame

In [26]:
data = np.random.rand(4, 5) * 20 + 10 # 4 dòng 5 cột
column_index = ['A', 'B', 'C', 'D', 'E']
row_index = ['X', 'Y', 'Z', 'K']
data_frame = pd.DataFrame(data, row_index, column_index)
data_frame

           A          B          C          D          E
X  26.374065  12.795542  18.669574  26.104457  24.875309
Y  11.348367  20.057134  29.788012  16.025053  16.717934
Z  18.885553  11.255078  10.549445  21.247036  14.135034
K  18.369152  25.633069  21.019394  14.717140  15.149096

# 2. Lấy 1 cột, 1 hàng

In [5]:
data_frame['A']

X    15.790505
Y    18.478263
Z    23.549420
K    25.526737
Name: A, dtype: float64

In [6]:
data_frame.loc['Z']
data_frame.iloc[2]

A    23.549420
B    21.342050
C    20.739189
D    13.915684
E    28.620826
Name: Z, dtype: float64

A    23.549420
B    21.342050
C    20.739189
D    13.915684
E    28.620826
Name: Z, dtype: float64

# 3. Lấy nhiều cột, nhiều hàng liên tục

In [7]:
data_frame[['A', 'B']]

           A          B
X  15.790505  13.498727
Y  18.478263  27.690204
Z  23.549420  21.342050
K  25.526737  16.922373

In [8]:
data_frame.loc[['X', 'Z']]

           A          B          C          D          E
X  15.790505  13.498727  29.343458  25.854705  29.957296
Z  23.549420  21.342050  20.739189  13.915684  28.620826

# 4. Lấy 1 khối hàng, cột

In [9]:
data_frame.loc[['Y', 'Z'], ['C', 'D']]

           C          D
Y  21.686611  21.727668
Z  20.739189  13.915684

# 5. Tạo cột mới

In [10]:
data_frame['Sum'] = data_frame['A'] + data_frame['B']
data_frame

           A          B          C          D          E        Sum
X  15.790505  13.498727  29.343458  25.854705  29.957296  29.289232
Y  18.478263  27.690204  21.686611  21.727668  21.770530  46.168467
Z  23.549420  21.342050  20.739189  13.915684  28.620826  44.891470
K  25.526737  16.922373  11.692301  11.959324  20.720798  42.449110

# 6. Xoá cột/hàng

In [11]:
data_frame.drop('Sum', axis=1, inplace=True)
# axis: 1 là cột, 0 là hàng
# inplace: True là xoá luôn, False là xoá tạm thời
data_frame

           A          B          C          D          E
X  15.790505  13.498727  29.343458  25.854705  29.957296
Y  18.478263  27.690204  21.686611  21.727668  21.770530
Z  23.549420  21.342050  20.739189  13.915684  28.620826
K  25.526737  16.922373  11.692301  11.959324  20.720798

# 7. Điều kiện
## a. 1 điều kiện

In [12]:
data_frame[data_frame['C'] > 20]

           A          B          C          D          E
X  15.790505  13.498727  29.343458  25.854705  29.957296
Y  18.478263  27.690204  21.686611  21.727668  21.770530
Z  23.549420  21.342050  20.739189  13.915684  28.620826

In [13]:
data_frame[data_frame['C'] > 20]['C']

X    29.343458
Y    21.686611
Z    20.739189
Name: C, dtype: float64

In [14]:
data_frame[data_frame['C'] > 20][['C', 'D']]

           C          D
X  29.343458  25.854705
Y  21.686611  21.727668
Z  20.739189  13.915684

## b. 2 điều kiện

In [15]:
data_frame[(data_frame['C'] > 20) & (data_frame['D'] > 15)]

           A          B          C          D          E
X  15.790505  13.498727  29.343458  25.854705  29.957296
Y  18.478263  27.690204  21.686611  21.727668  21.770530

In [16]:
data_frame[(data_frame['C'] > 20) & (data_frame['D'] > 15)][['C', 'D']]

           C          D
X  29.343458  25.854705
Y  21.686611  21.727668

# 8. Reset index (row) name

In [17]:
data_frame.reset_index()

  index          A          B          C          D          E
0     X  15.790505  13.498727  29.343458  25.854705  29.957296
1     Y  18.478263  27.690204  21.686611  21.727668  21.770530
2     Z  23.549420  21.342050  20.739189  13.915684  28.620826
3     K  25.526737  16.922373  11.692301  11.959324  20.720798

In [18]:
data_frame['States'] = ['CA', 'NY', 'WY', 'OR']
data_frame

           A          B          C          D          E States
X  15.790505  13.498727  29.343458  25.854705  29.957296     CA
Y  18.478263  27.690204  21.686611  21.727668  21.770530     NY
Z  23.549420  21.342050  20.739189  13.915684  28.620826     WY
K  25.526737  16.922373  11.692301  11.959324  20.720798     OR

In [19]:
data_frame.set_index('States')

                A          B          C          D          E
States
CA      15.790505  13.498727  29.343458  25.854705  29.957296
NY      18.478263  27.690204  21.686611  21.727668  21.770530
WY      23.549420  21.342050  20.739189  13.915684  28.620826
OR      25.526737  16.922373  11.692301  11.959324  20.720798

In [20]:
data_frame.set_index('A')

                   B          C          D          E States
A
15.790505  13.498727  29.343458  25.854705  29.957296     CA
18.478263  27.690204  21.686611  21.727668  21.770530     NY
23.549420  21.342050  20.739189  13.915684  28.620826     WY
25.526737  16.922373  11.692301  11.959324  20.720798     OR

# 9. Gom nhóm (Ít gặp)

# a. Cách tạo DataFrame có nhóm

In [8]:
data2 = np.random.rand(4, 5) * 20 + 10 # 4 dòng 5 cột
outsideLevelRow = ['a', 'a', 'b', 'b'] 
insideLevelRow = ['a1', 'a2', 'b1', 'b2']
column_index = ['X', 'Y', 'Z', 'K', 'L']
dataframe2 = pd.DataFrame(data2,  pd.MultiIndex.from_tuples(list(zip(outsideLevelRow, insideLevelRow))), column_index)
dataframe2

              X          Y          Z          K          L
a a1  26.810886  21.327336  25.948900  23.117483  12.493322
  a2  14.707380  20.001497  10.189413  13.483111  27.734517
b b1  16.713528  23.486748  13.618621  12.934899  28.498250
  b2  13.071762  11.564879  10.119242  20.650337  21.040782

## b. Cách lấy ra 1 nhóm, 1 ô trong nhóm

In [10]:
dataframe2.loc['b']

            X          Y          Z          K          L
b1  16.713528  23.486748  13.618621  12.934899  28.498250
b2  13.071762  11.564879  10.119242  20.650337  21.040782

In [11]:
dataframe2.loc['b']['Y']

b1    23.486748
b2    11.564879
Name: Y, dtype: float64

In [12]:
dataframe2.loc['b'].loc['b2']

X    13.071762
Y    11.564879
Z    10.119242
K    20.650337
L    21.040782
Name: b2, dtype: float64

In [13]:
dataframe2.loc['b'].loc['b2']['X']

13.071761661188741

## c. Đặt tên cho từng lớp của nhóm

In [17]:
dataframe2.index.names = ['Outside', 'Inside']
dataframe2

                        X          Y          Z          K          L
Outside Inside
a       a1      26.810886  21.327336  25.948900  23.117483  12.493322
        a2      14.707380  20.001497  10.189413  13.483111  27.734517
b       b1      16.713528  23.486748  13.618621  12.934899  28.498250
        b2      13.071762  11.564879  10.119242  20.650337  21.040782

## d. Trích xuất hàng cột linh hoạt với df.xs

In [21]:
dataframe2.xs("a") #axis = 0 là hàng

                X          Y          Z          K          L
Inside
a1      26.810886  21.327336  25.948900  23.117483  12.493322
a2      14.707380  20.001497  10.189413  13.483111  27.734517

In [22]:
dataframe2.xs("X", axis=1) # cột

Outside  Inside
a        a1        26.810886
         a2        14.707380
b        b1        16.713528
         b2        13.071762
Name: X, dtype: float64

In [25]:
dataframe2.xs("a", level=0)
dataframe2.xs("a1", level=1)

                X          Y          Z          K          L
Inside
a1      26.810886  21.327336  25.948900  23.117483  12.493322
a2      14.707380  20.001497  10.189413  13.483111  27.734517

                 X          Y        Z          K          L
Outside
a        26.810886  21.327336  25.9489  23.117483  12.493322

In [27]:
dataframe2.xs("a1", level=1, drop_level=True)
dataframe2.xs("a1", level=1, drop_level=False)

                 X          Y        Z          K          L
Outside
a        26.810886  21.327336  25.9489  23.117483  12.493322

                        X          Y        Z          K          L
Outside Inside
a       a1      26.810886  21.327336  25.9489  23.117483  12.493322